04_OpenFoam/_ref/OpenFOAM-14/XiFluid/engine2Valve2D/0/T.b
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.b;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField   uniform 700;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inletFuel
    {
        type            inletOutlet;
        phi             alphaPhi.b;
        inletValue      uniform 320;
    }

    inlet
    {
        type            inletOutlet;
        phi             alphaPhi.b;
        inletValue      uniform 350;
    }

    outlet
    {
        type            inletOutlet;
        phi             alphaPhi.b;
        inletValue      uniform 700;
    }

    piston
    {
        type            fixedValue;
        value           uniform 500;
    }

    liner
    {
        type            fixedValue;
        value           uniform 500;
    }

    cylinderHead
    {
        type            fixedValue;
        value           uniform 550;
    }

    ivHead
    {
        type            zeroGradient;
    }

    ivStem
    {
        type            zeroGradient;
    }

    evHead
    {
        type            zeroGradient;
    }

    evStem
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }

    "nonCouple.*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
